app/controllers/api/v1/beers_controller.rb

SELECT "beers".* FROM "beers" ORDER BY "beers"."brand" ASC
---
  def index
    @beers = Beer.all.order(brand: :asc)

INSERT INTO "beers" ("brand", "style", "country", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["brand", "u"], ["style", "u"], ["country", "USA"], ["quantity", 3], ["created_at", "2022-05-24 14:27:44.342168"], ["updated_at", "2022-05-24 14:27:44.342168"]]
---
  def create
    @beer = Beer.new(beer_params)

    if @beer.save