app/controllers/api/v1/brands_controller.rb

      def index
        @q = Brand.includes(:product_categories, :products,
          active_image_attachment: :blob).where(is_listed: true).ransack(params[:q])
        return export_csv_and_pdf if params[:format].present?

        no_of_record = params[:no_of_record] || 10
        @pagy, @brands = pagy(@q.result.order('brands.updated_at': :desc), items: no_of_record)
---
SELECT "brands".* FROM "brands" ORDER BY "brand" ASC

      def create
        @brand = Brand.new(brand_params)
        if @brand.save
---
INSERT INTO "brands" ("name", "country", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["country", "Netherlands"], ["description", "test"], ["created_at", "2022-05-25 12:14:15.653705"], ["updated_at", "2022-05-25 12:14:15.653705"]]

      def destroy
        @brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 2]]

        def set_brand
          @brand = Brand.includes(:products, active_image_attachment: :blob).find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]