app/controllers/api/v1/brands_controller.rb

      def index
        @brands = Brand.all.order(name: :asc)
---
SELECT "brands".* FROM "brands" ORDER BY "brands"."name" ASC